// Напиши скрипт обработки покупки в магазине
// - Баланс пользователя хранится в переменной balance
// - Сумма покупки хранится в переменной payment

// - Перед проверкой вывести сообщение:
// "Общая стоимость заказа [число] кредитов. Проверяем кол-во доступнных средств на счету"

// - Если сумма покупки не превышает баланс:
//  - вычесть из баланса сумму покупки
//  - вывести сообщение "На счету осталось (число) кредтов"
// - Если сумма покупки превышает баланс:
// "на счету недостаточно средств!"
// В конце вывести сообщенеи "операция завершена"

let balance = 10000;
const payment = 2000;

// "всё хорошо. снимаем деньги...спасибо за покупку!"